course/projects/2_RubyOnRails/1_login/Login/app/controllers/users_controller.rb

    def all
        render json: User.all
---
SELECT "users".* FROM "users"