course/projects/2_RubyOnRails/2_secure_password/secure_password/app/controllers/user_controller.rb

    def all
        if(session[:user_id])
            render json: User.all
---
SELECT "users".* FROM "users"

    def new
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "marcos"], ["password_digest", "[FILTERED]"], ["created_at", "2022-04-18 19:43:49.466118"], ["updated_at", "2022-04-18 19:43:49.466118"]]

    def login
        @user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "marcos"], ["LIMIT", 1]]